Repository: tollwerk/TYPO3-ext-tw_payment
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# menu.transaction.list
source: Transaction list
de: Transaktionsliste

# menu.transaction.new
source: New transaction
de: Neue Transaktion

# transaction.list.header
source: Transaction list
de: Transaktionsliste

# transaction.list.edit
source: Edit
de: Bearbeiten

# transaction.list.delete
source: Delete
de: Löschen

# transaction.list.hide
source: Hide
de: Ausblenden

# transaction.list.created.format
source: m/d/Y
de: d.m.Y

# transaction.new.header
source: Create new transaction
de: Neue Transaktion anlegen

# transaction.new.create
source: Create transaction
de: Transaktion anlegen

# transaction.show.header
source: Paying with credit card
de: Zahlung per Kreditkarte

# transaction.show.description
source: Use this page to carry out the following prepared credit card transaction to Ziereis Facsimiles:
de: Wir haben die folgende Transaktion für Sie vorbereitet. Im nächsten Schritt können Sie die Kreditkarten-Daten eintragen.

# transaction.pay
source: Pay with credit card now
de: Jetzt per Kreditkarte bezahlen

# transaction.pay.name
source: Ziereis Facsimiles
de: Ziereis Faksimiles

# transaction.pay.description
source: Your Personal Facsimile Experts
de: Ihre Faksimile-Experten

# error.1458140774
source: An error occured. Please correct the highlighted values.
de: Es ist ein Fehler aufgetreten. Bitte korrigieren Sie die hervorgehobenen Werte.

# transaction.charge.header.failed
source: Create transaction failed!
de: Anlegen der Transaktion fehlgeschlagen!

# transaction.charge.description.failed
source: The following error occured while processing your credit card transaction:
de: Bei der Verarbeitung Ihrer Transaktion ist folgender Fehler aufgetreten:

# transaction.charge.action.failed
source: Please get in touch with us to sort out the issue.
de: Bitte kontaktieren Sie uns, um etwaige Probleme zu lösen.

# transaction.charge.header.succeeded
source: Transaction completed
de: Transaktion erfolgreich

# transaction.charge.description.succeeded
source: Your credit card payment has been successfully completed. We are available if you have any questions or further requests.
de: Ihre Kreditkarten-Zahlung ist erfolgreich durchgeführt worden. Bei Fragen oder weiteren Wünschen stehen wir gerne zur Verfügung.

# transaction.charge.description.charged
source: This transaction has already been processed earlier. Thanks for using our service.
de: Diese Kreditkarten-Transaktion wurde bereits verarbeitet. Vielen Dank für die Nutzung unseres Angebots.

# tx_twpayment_domain_model_transaction
source: Transaction
de: Transaktion

# tx_twpayment_domain_model_transaction.sender
source: Credit Card Holder
de: Absender

# tx_twpayment_domain_model_transaction.sender.placeholder
source: John Doe
de: Max Mustermann

# tx_twpayment_domain_model_transaction.amount
source: Amount
de: Betrag

# tx_twpayment_domain_model_transaction.description
source: Use
de: Verwendungszweck

# tx_twpayment_domain_model_transaction.url
source: URL
de: Frontend-URL

# tx_twpayment_domain_model_transaction.description.placeholder
source: Invoice no. 987654
de: Rechnung-Nr. 987654

# tx_twpayment_domain_model_transaction.template
source: Template
de: Vorlage

# tx_twpayment_domain_model_transaction.created
source: Created
de: Erzeugt

# tx_twpayment_domain_model_transaction.error
source: Error
de: Fehler

# tx_twpayment_domain_model_transaction.charged
source: Charged
de: Gebucht

# tx_twpayment_domain_model_transaction.currency
source: Currency
de: Währung

# tx_twpayment_domain_model_currency
source: Currency
de: Währung

# tx_twpayment_domain_model_currency.currency
source: Currency
de: Währung
